using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LuckyTicketsApp
{
    // Есть 2 способа подсчёта счастливых билетов:

    // 1. Простой — если на билете напечатано шестизначное число, и сумма первых
    // трёх цифр равна сумме последних трёх, то этот билет считается счастливым.

    // 2. Сложный — если сумма чётных цифр билета равна сумме нечётных цифр билета,
    // то билет считается счастливым.

    // Определить программно какой вариант подсчёта счастливых билетов даст их большее
    // количество на заданном интервале. 

    // Входные параметры: min и max номер билета
    // Выход: информация о победившем методе и количестве счастливых билетов для каждого способа подсчёта.

    class LuckyTickets
    {
    }
}
