using System.Collections.Generic;

namespace DecodingNumberApp
{
    class DictionaryOfRussianNumbers
    {
        public Dictionary<int, string> numberDictionary = new Dictionary<int, string>()
        {
            { 0, "ноль" },
            { 1, "один" },
            { 2, "два" },
            { 3, "три" },
            { 4, "четыре" },
            { 5, "пять" },
            { 6, "шесть" },
            { 7, "семь" },
            { 8, "восемь" },
            { 9, "девять" },
            { 10, "десять" },
            { 11, "одинадцать" },
            { 12, "двенадцать" },
            { 13, "тринадцать" },
            { 14, "четырнадцать" },
            { 15, "пятнадцать" },
            { 16, "шестнадцать" },
            { 17, "семнадцать" },
            { 18, "восемнадцать" },
            { 19, "девятнадцать" },
            { 20, "двадцать" },
            { 30, "тридцать" },
            { 40, "сорок" },
            { 50, "пятьдесят" },
            { 60, "шестьдесят" },
            { 70, "семьдесят" },
            { 80, "восемьдесят" },
            { 90, "девяносто" },
            { 100, "сто" },
            { 200, "двести" },
            { 300, "триста" },
            { 400, "четыреста" },
            { 500, "пятьсот" },
            { 600, "шестьсот" },
            { 700, "семьсот" },
            { 800, "восемьсот" },
            { 900, "девятьсот" }
        };
        public Dictionary<int, string> valueRank = new Dictionary<int, string>()
        {
            { 1, "" },
            { 2, "" },
            { 3, "" },
            { 4, " тысяча " },
            { 5, " тысячи " },
            { 6, " тысяч " },
            { 9, " миллион " },
            { 10, " миллиона " },
            { 11, " миллионов " },
            { 16, " миллиард " },
            { 17, " миллиарда " },
            { 18, " миллиардов " },
            { 25, " биллион " },
            { 26, " биллиона " },
            { 27, " биллионов " },
            { 36, " биллиард " },
            { 37, " биллиарда " },
            { 38, " биллиардов " },
            { 49, " триллион " },
            { 50, " триллиона " },
            { 51, " триллионов " }
        };
        public Dictionary<int, string> thousandNamber = new Dictionary<int, string>()
        {
            { 1, "одна" },
            { 2, "две" }
        };
    }
}
